void ClearScreen() {
    printf("\033[2J"); // очищення екрану
    printf("\033[H"); // переміщення курсора в початок екрану
}
// \033 = escape
// \033[2J = очистити екран
// \033[H = перемістити курсор у верхній лівий кут
// \033[48;5;%d = [48;5 'фон'   %d 'значення кольору'   m 'стоп'
// \033[0m =  Повертає звичайний колір + ' ' відступ


int getColor(int value) { //ASCI colors 256 palette
    switch (value) {
        case 2: return 229; // світло-жовтий
        case 4: return 222; // пісочний 
        case 8: return 220; // жовтий 
        case 16: return 216; // світло-оранжевий
        case 32: return 208; // помаранчевий
        case 64: return 202; // темно-оранжевий
        case 128: return 196; // червоний
        case 256: return 160; // темно-червоний
        case 512: return 125; // рожевий 
        case 1024: return 93; // фіолетовий
        case 2048: return 56; // темно-фіолетовий
        default: return 236; // темно-сірий для пустих клітинок
    }
}